c16/retro/esp32-c3-demo-idf/sdkconfig.defaults
# ESP32-C3 Round Display Demo - Default Configuration

# Enable Arduino as component
CONFIG_ENABLE_ARDUINO_DEPENDS=y

# USB Serial/JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ESP32-C3 specific
CONFIG_IDF_TARGET="esp32c3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Serial monitor
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y
CONFIG_ESPTOOLPY_BAUD_921600B=y
